{
  "_name_or_path": "AutoTrain",
  "architectures": [
    "SwinForImageClassification"
  ],
  "attention_probs_dropout_prob": 0.0,
  "depths": [
    2,
    2,
    18,
    2
  ],
  "drop_path_rate": 0.1,
  "embed_dim": 128,
  "encoder_stride": 32,
  "hidden_act": "gelu",
  "hidden_dropout_prob": 0.0,
  "hidden_size": 1024,
  "id2label": {
    "0": "AK-47",
    "1": "AWP",
    "10": "USP",
    "2": "Famas",
    "3": "Galil-AR",
    "4": "Glock",
    "5": "M4A1",
    "6": "M4A4",
    "7": "P-90",
    "8": "SG-553",
    "9": "UMP"
  },
  "image_size": 224,
  "initializer_range": 0.02,
  "label2id": {
    "AK-47": "0",
    "AWP": "1",
    "Famas": "2",
    "Galil-AR": "3",
    "Glock": "4",
    "M4A1": "5",
    "M4A4": "6",
    "P-90": "7",
    "SG-553": "8",
    "UMP": "9",
    "USP": "10"
  },
  "layer_norm_eps": 1e-05,
  "max_length": 128,
  "mlp_ratio": 4.0,
  "model_type": "swin",
  "num_channels": 3,
  "num_heads": [
    4,
    8,
    16,
    32
  ],
  "num_layers": 4,
  "padding": "max_length",
  "patch_size": 4,
  "path_norm": true,
  "problem_type": "single_label_classification",
  "qkv_bias": true,
  "torch_dtype": "float32",
  "transformers_version": "4.25.1",
  "use_absolute_embeddings": false,
  "window_size": 7
}
